package com.java.member.employee;

public class Action {
	
	public static void main(String[] args) {
		
	
	/*
	 * 행동 로그
	 
	 날짜(yyyy-mm-dd),Id,행동경로,행동경로,행동경로
	 ex) 2023-01-31,eunsol,직원관리~~~근무지변경,민원~~~ㅈ분실물검색
	 출력 되는 기능 : 
	 1. 번호 입력 받은 걸 문자로?바꾸기?
	 2. 
	 
	 
	 
	 */
		
		역관리-의자 없는 열차 추가
		역관리-일반 열차 추가
		//
		직원 관리-전체 직원 정보 보기-호선으로 직원 검색
		직원 관리-전체 직원 정보 보기-역 이름으로 직원 검색
		직원 관리-전체 직원 정보 보기-이름으로 직원 검색
		
		직원 관리-직원 정보 수정-근무지 변경
		직원 관리-직원 정보 수정-직급 변경
		직원 관리-직원 정보 수정-직원 삭제
		
		안전 요원 관리-전체 안전 요원 보기-호선으로 안전 요원 검색
		안전 요원 관리-전체 안전 요원 보기-역 이름으로 안전 요원 검색
		
		안전 요원 관리-안전 요원 배치
		안전 요원 관리-안전 요원 부서 해제
		//
		고객의 소리-전체 분실물 보기-분실물 검색
		고객의 소리-전체 분실물 보기-분실물 추가/제거
		
		고객의 소리-전체 민원 보기
		
		
		

	}
}
